dimension text orientation
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
 Syntax
  C#
public OrdinateTextOrientation TextOrientation { get; set; }
  Visual Basic
Public Property TextOrientation As OrdinateTextOrientation
	Get
	Set
  Visual C++
public:
property OrdinateTextOrientation TextOrientation {
	OrdinateTextOrientation get ();
	void set (OrdinateTextOrientation value);
}
 Exceptions
  Exception  |   Condition
   Autodesk.Revit.Exceptions ArgumentOutOfRangeException   |   When setting this property: A value passed for an enumeration argument is not a member of that enumeration
 See Also
  OrdinateDimensionSetting Class
  Autodesk.Revit.DB Namespace